package unit4.classesAndObjects.task8;

/**
 * 8. Создать класс Customer, спецификация которого приведена ниже.
 * Определить конструкторы, set и get методы, метод toString().
 * Создать второй класс, агрегирующий массив типа Customer, с подходящими конструкторами и методами.
 * Задать критерии выбора данных и вывести эти данные на консоль.
 * Класс Customer:
 * ___id,
 * ___фамилия,
 * ___имя,
 * ___отчество,
 * ___адрес,
 * ___номер кредитной карточки,
 * ___номер банковского счета.
 * Найти и вывести:
 * a) список покупателей в алфавитном порядке;
 * b) список покупателей, у которых номер кредитной карточки находится в заданном интервале
 */
public class Task8 {
}
