package unit3.stringOrStringbuilder;

public class tasks {
//    1. Дан текст (строка). Найдите наибольшее количество подряд идущих пробелов в нем.
//    7. Вводится строка. Требуется удалить из нее повторяющиеся символы и все пробелы.
//    Например, если было введено "abc cde def", то должно быть выведено "abcdef".
//    8. Вводится строка слов, разделенных пробелами.
//    Найти самое длинное слово и вывести его на экран.
//    Случай, когда самых длинных слов может быть несколько, не обрабатывать.
//    9. Посчитать количество строчных (маленьких) и прописных (больших) букв в введенной строке.
//    Учитывать только английские буквы.
//    10. Строка X состоит из нескольких предложений,
//    каждое из которых кончается точкой, восклицательным или вопросительным знаком.
//    Определить количество предложений в строке X.

}
