package unit4.classesAndObjects;

public class tasks {
//   9. Создать класс Book, спецификация которого приведена ниже. Определить конструкторы, set- и get- методы и метод toString(). Создать второй класс, агрегирующий массив типа Book, с подходящими конструкторами и методами. Задать критерии выбора данных и вывести эти данные на консоль.
//    Book: id, название, автор(ы), издательство, год издания, количество страниц, цена, тип переплета. Найти и вывести: a) список книг заданного автора; b) список книг, выпущенных заданным издательством; c) список книг, выпущенных после заданного года.
//   10. Создать класс Airline, спецификация которого приведена ниже. Определить конструкторы, set- и get- методы и метод toString(). Создать второй класс, агрегирующий массив типа Airline, с подходящими конструкторами и методами. Задать критерии выбора данных и вывести эти данные на консоль.
//    Airline: пункт назначения, номер рейса, тип самолета, время вылета, дни недели. Найти и вывести: a) список рейсов для заданного пункта назначения; b) список рейсов для заданного дня недели; c) список рейсов для заданного дня недели, время вылета для которых больше заданного.
}
